I am still seeing this issue with Version 1.0.2

resource "intersight_appliance_device_claim" "appliance_device_claim" {
  device_id      = "yyyyyyyy"
  security_token = "xxxxxxx"
}


% terraform apply  

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # intersight_appliance_device_claim.appliance_device_claim will be created
  + resource "intersight_appliance_device_claim" "appliance_device_claim" {
      + account         = (known after apply)
      + class_id        = (known after apply)
      + device_id       = "yyyyyyyy"
      + id              = (known after apply)
      + is_password_set = (known after apply)
      + is_renew        = false
      + message         = (known after apply)
      + moid            = (known after apply)
      + object_type     = (known after apply)
      + security_token  = "xxxxxx"
      + status          = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

intersight_appliance_device_claim.appliance_device_claim: Creating...

Error: failed while creating ApplianceDeviceClaim: undefined response type Response from endpoint: {"code":"InvalidUrl","message":"Operation not supported. Check if the API path and method are valid.","messageId":"iam_invalid_method_operation","messageParams":{},"traceId":"NB441597ea1fc2be1de409de4230d16b96"}